Tf plan output:
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.stateless.module.etl_instance.aws_instance.main must be replaced
-/+ resource "aws_instance" "main" {
      ~ ami                          = "ami-0b898040803850657" -> "ami-0da4ada12e4a09085" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:577373831711:instance/i-0f50fc1b8b2b7d761" -> (known after apply)
        associate_public_ip_address  = false
        availability_zone            = "us-east-1b"
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
        get_password_data            = false
      + host_id                      = (known after apply)
        iam_instance_profile         = "bfd-test-etl-profile"
      ~ id                           = "i-0f50fc1b8b2b7d761" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ instance_type                = "m5.large" -> "m5.2xlarge"
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      ~ key_name                     = "bfd-rick-test" -> "bfd-test" # forces replacement
        monitoring                   = true
      + network_interface_id         = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0f195fdb7dc3c7d0b" -> (known after apply)
      ~ private_dns                  = "ip-10-235-21-61.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.235.21.61" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ security_groups              = [] -> (known after apply)
        source_dest_check            = true
        subnet_id                    = "subnet-048c7b59678709fa4"
        tags                         = {
            "Environment" = "test"
            "Layer"       = "data"
            "Name"        = "bfd-test-etl"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "etl"
            "stack"       = "test"
        }
        tenancy                      = "default"
      ~ user_data                    = "9faef1e339e16bcae2eb3358f11a377389e5e01c" -> "26b46e2453538be494ae2505d86b5b9443e00772" # forces replacement
      ~ volume_tags                  = {} -> (known after apply)
        vpc_security_group_ids       = [
            "sg-08a5db0c457334064",
        ]

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
            delete_on_termination = true
            encrypted             = true
          ~ iops                  = 300 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:577373831711:key/7dcca42a-da93-40b1-a4a8-2eb10050f449" -> "alias/bfd-test-cmk" # forces replacement
          ~ volume_id             = "vol-0ca66bcb67f6ef564" -> (known after apply)
            volume_size           = 100
            volume_type           = "gp2"
        }
    }

  # module.stateless.module.fhir_asg.aws_autoscaling_group.main must be replaced
+/- resource "aws_autoscaling_group" "main" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:577373831711:autoScalingGroup:417c93df-e16d-4472-b31d-a7a0af1b0536:autoScalingGroupName/bfd-test-fhir-20190912165036054800000001" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-1a",
          - "us-east-1b",
          - "us-east-1c",
        ] -> (known after apply)
      ~ default_cooldown          = 300 -> (known after apply)
        desired_capacity          = 3
        enabled_metrics           = [
            "GroupDesiredCapacity",
            "GroupInServiceInstances",
            "GroupMaxSize",
            "GroupMinSize",
            "GroupPendingInstances",
            "GroupStandbyInstances",
            "GroupTerminatingInstances",
            "GroupTotalInstances",
        ]
        force_delete              = false
        health_check_grace_period = 300
        health_check_type         = "ELB"
      ~ id                        = "bfd-test-fhir-20190912165036054800000001" -> (known after apply)
      ~ launch_configuration      = "bfd-test-fhir-20190912165036054800000001" -> (known after apply)
      ~ load_balancers            = [] -> (known after apply)
        max_size                  = 6
        metrics_granularity       = "1Minute"
        min_elb_capacity          = 3
        min_size                  = 3
      ~ name                      = "bfd-test-fhir-20190912165036054800000001" -> (known after apply) # forces replacement
        protect_from_scale_in     = false
      ~ service_linked_role_arn   = "arn:aws:iam::577373831711:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes       = [] -> null
        target_group_arns         = [
            "arn:aws:elasticloadbalancing:us-east-1:577373831711:targetgroup/bfd-test-fhir/4c399c3320586760",
        ]
      - termination_policies      = [] -> null
        vpc_zone_identifier       = [
            "subnet-0334c1f4eec7a52af",
            "subnet-059284636c71808eb",
            "subnet-0a6ee82462453afbb",
        ]
        wait_for_capacity_timeout = "10m"
        wait_for_elb_capacity     = 3

        tag {
            key                 = "Environment"
            propagate_at_launch = true
            value               = "test"
        }
        tag {
            key                 = "Layer"
            propagate_at_launch = true
            value               = "app"
        }
        tag {
            key                 = "Name"
            propagate_at_launch = true
            value               = "bfd-test-fhir"
        }
        tag {
            key                 = "application"
            propagate_at_launch = true
            value               = "bfd"
        }
        tag {
            key                 = "business"
            propagate_at_launch = true
            value               = "oeda"
        }
        tag {
            key                 = "role"
            propagate_at_launch = true
            value               = "fhir"
        }
        tag {
            key                 = "stack"
            propagate_at_launch = true
            value               = "test"
        }
    }

  # module.stateless.module.fhir_asg.aws_autoscaling_policy.high-cpu must be replaced
-/+ resource "aws_autoscaling_policy" "high-cpu" {
        adjustment_type           = "ChangeInCapacity"
      ~ arn                       = "arn:aws:autoscaling:us-east-1:577373831711:scalingPolicy:c9925923-39c8-4032-8a42-307eea80d01a:autoScalingGroupName/bfd-test-fhir-20190912165036054800000001:policyName/bfd-test-fhir-high-cpu-scaleup" -> (known after apply)
      ~ autoscaling_group_name    = "bfd-test-fhir-20190912165036054800000001" -> (known after apply) # forces replacement
        cooldown                  = 300
      - estimated_instance_warmup = 0 -> null
      ~ id                        = "bfd-test-fhir-high-cpu-scaleup" -> (known after apply)
      + metric_aggregation_type   = (known after apply)
        name                      = "bfd-test-fhir-high-cpu-scaleup"
        policy_type               = "SimpleScaling"
        scaling_adjustment        = 2
    }

  # module.stateless.module.fhir_asg.aws_autoscaling_policy.low-cpu must be replaced
-/+ resource "aws_autoscaling_policy" "low-cpu" {
        adjustment_type           = "ChangeInCapacity"
      ~ arn                       = "arn:aws:autoscaling:us-east-1:577373831711:scalingPolicy:96a24271-eee3-46db-8a19-37a0a6692c77:autoScalingGroupName/bfd-test-fhir-20190912165036054800000001:policyName/bfd-test-fhir-low-cpu-scaledown" -> (known after apply)
      ~ autoscaling_group_name    = "bfd-test-fhir-20190912165036054800000001" -> (known after apply) # forces replacement
        cooldown                  = 300
      - estimated_instance_warmup = 0 -> null
      ~ id                        = "bfd-test-fhir-low-cpu-scaledown" -> (known after apply)
      + metric_aggregation_type   = (known after apply)
        name                      = "bfd-test-fhir-low-cpu-scaledown"
        policy_type               = "SimpleScaling"
        scaling_adjustment        = -1
    }

  # module.stateless.module.fhir_asg.aws_cloudwatch_metric_alarm.high-cpu will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "high-cpu" {
        actions_enabled           = true
      ~ alarm_actions             = [
          - "arn:aws:autoscaling:us-east-1:577373831711:scalingPolicy:c9925923-39c8-4032-8a42-307eea80d01a:autoScalingGroupName/bfd-test-fhir-20190912165036054800000001:policyName/bfd-test-fhir-high-cpu-scaleup",
        ] -> (known after apply)
      ~ alarm_description         = "CPU usage for bfd-test-fhir-20190912165036054800000001 ASG" -> (known after apply)
        alarm_name                = "bfd-test-fhir-high-cpu"
        arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-test-fhir-high-cpu"
        comparison_operator       = "GreaterThanOrEqualToThreshold"
        datapoints_to_alarm       = 0
      ~ dimensions                = {
          - "AutoScalingGroupName" = "bfd-test-fhir-20190912165036054800000001"
        } -> (known after apply)
        evaluation_periods        = 2
        id                        = "bfd-test-fhir-high-cpu"
        insufficient_data_actions = []
        metric_name               = "CPUUtilization"
        namespace                 = "AWS/EC2"
        ok_actions                = []
        period                    = 120
        statistic                 = "Average"
        tags                      = {}
        threshold                 = 60
        treat_missing_data        = "missing"
    }

  # module.stateless.module.fhir_asg.aws_cloudwatch_metric_alarm.low-cpu will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "low-cpu" {
        actions_enabled           = true
      ~ alarm_actions             = [
          - "arn:aws:autoscaling:us-east-1:577373831711:scalingPolicy:96a24271-eee3-46db-8a19-37a0a6692c77:autoScalingGroupName/bfd-test-fhir-20190912165036054800000001:policyName/bfd-test-fhir-low-cpu-scaledown",
        ] -> (known after apply)
      ~ alarm_description         = "CPU usage for bfd-test-fhir-20190912165036054800000001 ASG" -> (known after apply)
        alarm_name                = "bfd-test-fhir-low-cpu"
        arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-test-fhir-low-cpu"
        comparison_operator       = "LessThanOrEqualToThreshold"
        datapoints_to_alarm       = 0
      ~ dimensions                = {
          - "AutoScalingGroupName" = "bfd-test-fhir-20190912165036054800000001"
        } -> (known after apply)
        evaluation_periods        = 2
        id                        = "bfd-test-fhir-low-cpu"
        insufficient_data_actions = []
        metric_name               = "CPUUtilization"
        namespace                 = "AWS/EC2"
        ok_actions                = []
        period                    = 120
        statistic                 = "Average"
        tags                      = {}
        threshold                 = 20
        treat_missing_data        = "missing"
    }

  # module.stateless.module.fhir_asg.aws_launch_configuration.main must be replaced
+/- resource "aws_launch_configuration" "main" {
        associate_public_ip_address      = false
      ~ ebs_optimized                    = false -> (known after apply)
        enable_monitoring                = true
        iam_instance_profile             = "bfd-test-fhir-profile"
      ~ id                               = "bfd-test-fhir-20190912165036054800000001" -> (known after apply)
      ~ image_id                         = "ami-0b898040803850657" -> "ami-0f4b635320a4da6dc" # forces replacement
      ~ instance_type                    = "m5.large" -> "m5.2xlarge" # forces replacement
      ~ key_name                         = "bfd-rick-test" -> "bfd-test" # forces replacement
      ~ name                             = "bfd-test-fhir-20190912165036054800000001" -> (known after apply)
        name_prefix                      = "bfd-test-fhir-"
        placement_tenancy                = "default"
        security_groups                  = [
            "sg-08c2e0d1154beffde",
            "sg-0cdc89644d5f3499d",
        ]
      ~ user_data                        = "b4f6b96af21f1ca2505513107b2fc4987416222a" -> "0bf2741fd39928a6f514cf0e8f5c34a31c01034b" # forces replacement
      - vpc_classic_link_security_groups = [] -> null

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ root_block_device {
            delete_on_termination = true
            encrypted             = true
          ~ iops                  = 0 -> (known after apply)
            volume_size           = 100
            volume_type           = "gp2"
        }
    }

Plan: 5 to add, 2 to change, 5 to destroy.
```